# ReplaceSpareSpaceOnPanelBoard Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..ReplaceSpareSpaceOnPanelBoard Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
Need to replace spare or space on panelboard.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ReplaceSpareSpaceOnPanelBoard { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ReplaceSpareSpaceOnPanelBoard As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ReplaceSpareSpaceOnPanelBoard {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace